app/views/orders/_form.html.erb

<%= form_with(model: [ @item, @item.orders.build ],cope: :order,local: true) do |form| %>
---
SELECT "orders".* FROM "orders" WHERE "orders"."item_id" = ?  [["item_id", 5]]