app/views/orders/index.html.erb

<h2>Orders till date</h2>
<% @item.orders.each do |order| %>
---
SELECT "orders".* FROM "orders" WHERE "orders"."item_id" = ?  [["item_id", 5]]