app/views/items/show.html.erb

<br>
<%= render @item.orders %>
---
SELECT "orders".* FROM "orders" WHERE "orders"."item_id" = ?  [["item_id", 14]]