app/controllers/items_controller.rb

	def create
		@item = Item.new(item_params)
		if @item.save
---
INSERT INTO "items" ("title", "text1", "text2", "text3", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Mars"], ["text1", "2"], ["text2", "coops"], ["text3", 30.0], ["created_at", "2019-03-29 16:42:26.621629"], ["updated_at", "2019-03-29 16:42:26.621629"]]