app/controllers/orders_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
 def index
   @item = Item.find(params[:item_id])

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."item_id" = ? AND "orders"."id" = ? LIMIT ?  [["item_id", 5], ["id", 5], ["LIMIT", 1]]
---
def show
	@item = Item.find(params[:item_id])
    @order = @item.orders.find(params[:id])

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."item_id" = ? AND "orders"."id" = ? LIMIT ?  [["item_id", 1], ["id", 1], ["LIMIT", 1]]
INSERT INTO "orders" ("name", "address", "number", "item_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Me"], ["address", "2"], ["number", "2"], ["item_id", 5], ["created_at", "2019-03-31 21:45:19.885427"], ["updated_at", "2019-03-31 21:45:19.885427"]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
def create
    @item = Item.find(params[:item_id])
    @order = @item.orders.create(order_params)

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."item_id" = ? AND "orders"."id" = ? LIMIT ?  [["item_id", 5], ["id", 5], ["LIMIT", 1]]
DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 4]]
---
 def destroy
    @item = Item.find(params[:item_id])
    @order = @item.orders.find(params[:id])
    @order.destroy